Pandas

# Boolean

In [29]:
True == False

False

In [31]:
True != 0

True

In [7]:
False == 0

True

In [9]:
True or False

True

In [10]:
1 == '1'

False

In [13]:
eng = 'Korea COVID 19'
eng.lower()

'korea covid 19'

In [14]:
eng.upper()

'KOREA COVID 19'

In [811]:
list_data=[1,2,3,4,5]
tuple_data=(1,2,3,4,5)
dic_data={1:100,2:200,3:300,4:400,5:500}

In [1854]:
type(list_data),type(tuple_data),type(dic_data)

(list, tuple, dict)

In [1857]:
list_data[0]

1

In [1863]:
tuple_data[0]

1

In [1876]:
list_data[:3]

[1, 2, 3]

In [1878]:
list_data[-1]='마지막'
list_data[-1]

'마지막'

In [1886]:
tuple_data[2] = '오류'

TypeError: 'tuple' object does not support item assignment

In [2388]:
data=[]
data.append('cobol')
data.append('java')
data.append('c')
data.append('python')
data

['cobol', 'java', 'c', 'python']

In [2389]:
data[0],data[-1],data[1:],data[:2]

('cobol', 'python', ['java', 'c', 'python'], ['cobol', 'java'])

In [2391]:
data.sort()
data

['c', 'cobol', 'java', 'python']

In [2392]:
data.reverse()
data

['python', 'java', 'cobol', 'c']

In [2727]:
dic = {'name1':'경민','학번1':20103,'name2':'경민2','학번2':20104}
dic.get('name1')
dic.keys()
dic.values()

dict_values(['경민', 20103, '경민2', 20104])

In [2730]:
lunch = {'햄버거','치킨','라면','콜라',10000}
dinner = {'피자','족발','라면','콜라',10000}

In [2732]:
lunch & dinner

{10000, '라면', '콜라'}

In [2735]:
dinner | lunch

{10000, '라면', '족발', '치킨', '콜라', '피자', '햄버거'}

In [2740]:
import pandas as pd
a=[ 1,2,3 ]
df = pd.DataFrame(a,index=[1,2,3])
df

   0
1  1
2  2
3  3

In [2749]:
b=[4,5,6]
df = pd.DataFrame(data=dict(num = a,sum = b), index=['a','b','c'], columns=None)
df

   num  sum
a    1    4
b    2    5
c    3    6

In [2758]:
man = {
    'num' : [1,2,3],
    'sum' : [3,4,5]
}

In [2760]:
df = pd.DataFrame(man)
df

   num  sum
0    1    3
1    2    4
2    3    5

In [2836]:
man = [
    {'num':1, 'sum':4},
    {'num':2, 'sum':4},
    {'num':3, 'sum':4}
]
df = pd.DataFrame(man, index=[1,2,3])
df

   num  sum
1    1    4
2    2    4
3    3    4

In [2843]:
person = [
    ['a',100,80],['b',50,40],['d',90,80]
]
df=pd.DataFrame(person)
df

   0    1   2
0  a  100  80
1  b   50  40
2  d   90  80

In [2844]:
person = {
    'name':['a','b','c','d'],
    '국어':[100,17,50,90],
    '영어':[80,60,40,80]
}

In [2851]:
df=pd.DataFrame(person, index=[4,5,6,7])
df

  name   국어  영어
4    a  100  80
5    b   17  60
6    c   50  40
7    d   90  80

In [2856]:
df[['국어','영어']] > 70

C:\Users\user\Anaconda3\lib\site-packages\IPython\core\displayhook.py:276: UserWarning: Output cache limit (currently 1000 entries) hit.
Flushing oldest 200 entries.
  'Flushing oldest {cull_count} entries.'.format(sz=sz, cull_count=cull_count))

      국어     영어
4   True   True
5  False  False
6  False  False
7   True   True

In [2870]:
person = {
    'C':[10,10,10,10,10],
    'R':[100,17,50,90,10],
    'JAVA':[80,60,40,80,10]
}
df=pd.DataFrame(person, index = ['1교시','2교시','3교시','4교시','5교시'])
df

      C    R  JAVA
1교시  10  100    80
2교시  10   17    60
3교시  10   50    40
4교시  10   90    80
5교시  10   10    10